In [1]:
import numpy as np
import pandas as pd
import io
import sys

from io import StringIO

for p in (np, pd):
    print(p.__name__, p.__version__)

numpy 1.18.1
pandas 1.0.3

> **LC 1149**

Medium

Linkedin phone interview question

There is no primary key for this table, it may have duplicate rows.
Each row of this table indicates that some viewer viewed an article (written by some author) on some date. 
Note that equal author_id and viewer_id indicate the same person.

In [35]:
data = StringIO(
"""
article_id,author_id,viewer_id,view_date
1,3,5,2019-08-01 
3,4,5,2019-08-01 
1,3,6,2019-08-02 
2,7,7,2019-08-01 
2,7,6,2019-08-02 
4,7,1,2019-07-22 
3,4,4,2019-07-21 
3,4,4,2019-07-21 

"""
)

 
df = (
    pd.read_csv(data, sep=",")
      .assign(
    view_date=lambda x: pd.to_datetime(x['view_date'])
)
)

df.head(20)

   article_id  author_id  viewer_id  view_date
0           1          3          5 2019-08-01
1           3          4          5 2019-08-01
2           1          3          6 2019-08-02
3           2          7          7 2019-08-01
4           2          7          6 2019-08-02
5           4          7          1 2019-07-22
6           3          4          4 2019-07-21
7           3          4          4 2019-07-21

Q1. find all the people who viewed more than one article on the same date, sorted in ascending order by their id.

The solution in SQL 

```SQL

    SELECT viewer_id
    FROM views
    GROUP BY viewer_id, view_date
    HAVING COUNT(DISTINCT article_id) > 1
    ORDER BY viewer_id

```

`HAVING` is translated to `groupby` followed by `agg` and `loc`

In [44]:
(
    df.groupby(['viewer_id', 'view_date'], as_index=False)
    .agg({'article_id': pd.Series.nunique})
    .loc[lambda x: x.article_id > 1, ['viewer_id']]
)

   viewer_id
2          5
3          6

Q2. How many members viewed more than one article on 2019-08-01?

```SQL

SELECT viewer_id
FROM Views
WHERE CONVERT(DATE, view_date) = CAST('2019-08-01' AS DATE) 
GROUP BY viewer_id
HAVING COUNT(DISTINCT article_id) > 1


```

In [48]:
(
    df
    .loc[df.view_date == '2019-08-01']
    .groupby(['viewer_id', 'view_date'], as_index=False)
    .agg({'article_id': pd.Series.nunique})
    .loc[lambda x: x.article_id > 1, ['viewer_id']]
)

   viewer_id
0          5

Q3. How many article authors have never viewed their own article?

```SQL
    SELECT COUNT(author_id)
    FROM Views
    WHERE author_id NOT IN (
    SELECT DISTINCT author_id 
    FROM Views
    WHERE author_id == viewer_id
)

```

In [49]:
(
    df
    .loc[~df.author_id
         .isin(df.loc[df.author_id == df.viewer_id, 'author_id']
               .unique())
        ]
)

   article_id  author_id  viewer_id  view_date
0           1          3          5 2019-08-01
2           1          3          6 2019-08-02

> **LC 615**

In [53]:
salary_data = StringIO(
"""
id,employee_id,amount,pay_date
1 ,1          ,9000  ,2017-03-31
2 ,2          ,6000  ,2017-03-31
3 ,3          ,10000 ,2017-03-31
4 ,1          ,7000  ,2017-02-28
5 ,2          ,6000  ,2017-02-28
6 ,3          ,8000  ,2017-02-28

"""
)

 
df_salary = (
    pd.read_csv(salary_data, sep=",")
      .assign(
    pay_date=lambda x: pd.to_datetime(x['pay_date'])
)
)

df_salary.head(20)

   id  employee_id  amount   pay_date
0   1            1    9000 2017-03-31
1   2            2    6000 2017-03-31
2   3            3   10000 2017-03-31
3   4            1    7000 2017-02-28
4   5            2    6000 2017-02-28
5   6            3    8000 2017-02-28

In [54]:
employee_data = StringIO(
"""

employee_id,department_id
1          ,1            
2          ,2            
3          ,2            

"""

)

df_employee = (
    pd.read_csv(employee_data, sep=",")
)

df_employee.head(20)

   employee_id  department_id
0            1              1
1            2              2
2            3              2

Q1. Given two tables as below, write a query to display the comparison result (higher/lower/same) of the average salary of employees in a department to the companyâ€™s average salary.

```SQL

    WITH dept_avg_salary AS (
      SELECT department_id, LEFT(CONVERT(VARCHAR, pay_date, 23), 7) AS month, AVG(Amount) as dept_avg_salary
      FROM Salary AS s JOIN Employee AS e ON (
            s.employee_id = e.employee_id
      )
      GROUP BY department_id, LEFT(CONVERT(VARCHAR, pay_date, 23), 7)
    ), company_avg_salary AS (
      SELECT LEFT(CONVERT(VARCHAR, pay_date, 23), 7) AS month, AVG(Amount) AS company_avg_salary
      FROM Salary
      GROUP BY LEFT(CONVERT(VARCHAR, pay_date, 23), 7)
    )
    SELECT department_id, d.month,
        (
            CASE  
                WHEN dept_avg_salary < company_avg_salary THEN 'LOWER'
                WHEN dept_avg_salary > company_avg_salary  THEN 'HIGHER'
                ELSE 'SAME'
            END
        ) AS dept_vs_company
    FROM dept_avg_salary AS d JOIN company_avg_salary AS c ON (
            d.month = c.month
 )

```

In [63]:
# how to groupby year and month, pipe temp into groupby and reference columns?
# as_index = False will NOT output the two groupby columns
df_dept = (pd.merge(left=df_salary, right=df_employee, left_on='employee_id', right_on='employee_id'))
df_dept = df_dept.groupby([df_dept.department_id, df_dept.pay_date.dt.strftime("%Y-%m")])['amount'].mean().reset_index()
df_dept

   department_id pay_date  amount
0              1  2017-02    7000
1              1  2017-03    9000
2              2  2017-02    7000
3              2  2017-03    8000

In [71]:
df = (
    df_salary
    .pipe(pd.merge, right=df_employee, left_on='employee_id', right_on='employee_id')
    .assign(dept_avg = lambda x: x.groupby([x.department_id, x.pay_date.dt.strftime("%Y-%m")])['amount'].transform('mean'))
    .assign(company_avg = lambda x: x.groupby(x.pay_date.dt.strftime("%Y-%m")).amount.transform('mean'))
)
df

   id  employee_id  amount   pay_date  department_id  dept_avg  company_avg
0   1            1    9000 2017-03-31              1      9000  8333.333333
1   4            1    7000 2017-02-28              1      7000  7000.000000
2   2            2    6000 2017-03-31              2      8000  8333.333333
3   5            2    6000 2017-02-28              2      7000  7000.000000
4   3            3   10000 2017-03-31              2      8000  8333.333333
5   6            3    8000 2017-02-28              2      7000  7000.000000

> **LinkedIn Question 3**

In [95]:
df = pd.DataFrame(
    {'Member_ID': [1, 1, 1, 2, 2, 2, 3, 3, 3, 3, 4, 4, 4],
     'Company': ['Microsoft', 'Google', 'Facebook',
                 'Microsoft', 'Google', 'Oracle',
                 'Microsoft', 'Oracle', 'Microsoft', 'Google',
                 'Microsoft', 'Apple', 'Google'
                ],
     'Year_Start': [2000, 2006, 2012, 
                    2001, 2007, 2004,
                    2001, 2002, 2003, 2004,
                    2004, 2005, 2006
                   ]
   }
)

df

    Member_ID    Company  Year_Start
0           1  Microsoft        2000
1           1     Google        2006
2           1   Facebook        2012
3           2  Microsoft        2001
4           2     Google        2007
5           2     Oracle        2004
6           3  Microsoft        2001
7           3     Oracle        2002
8           3  Microsoft        2003
9           3     Google        2004
10          4  Microsoft        2004
11          4      Apple        2005
12          4     Google        2006

Q3: How many people went to Google from Microsoft directly and indirectly?

ANS: 4

```SQL

    SELECT COUNT(DISTINCT e1.Member_ID) AS Number_Employees
    FROM emp_history AS e1 JOIN emp_history AS e2 ON (
        
        e1.Member_ID == e2.Member_ID
    )
    WHERE e1.Company == 'Microsoft' AND e2.company == 'Google' AND (
        e1.Year_Start < e2.Year_Start
    )

```

In [76]:
df.loc[df.Company.isin(('Microsoft', 'Google'))].pipe(
    pd.merge, right=df.loc[df.Company.isin(('Microsoft', 'Google'))], 
    left_on='Member_ID', right_on='Member_ID', suffixes=('_1', '_2')
).loc[lambda x: (x.Company_1 == 'Microsoft') & (x.Company_2 == 'Google') &
     (x.Year_Start_1 < x.Year_Start_2)]

    Member_ID  Company_1  Year_Start_1 Company_2  Year_Start_2
1           1  Microsoft          2000    Google          2006
5           2  Microsoft          2001    Google          2007
10          3  Microsoft          2001    Google          2004
13          3  Microsoft          2003    Google          2004

Q4: How many people went to Google from Microsoft directly?

ANS = 2

```SQL
    
    WITH emp_history_index AS (
        SELECT Member_ID, Company, Year_Start, 
        ROW_NUMBER() OVER(PARTITION BY Member_ID ORDER BY Year_Start) AS Seq
        FROM Emp_History
    )
    SELECT e1.Member_ID
    FROM emp_history_index AS e1 JOIN emp_history_index AS e2 ON (
    
        e1.Member_ID = e2.Member_ID AND
        e2.Seq - e1.Seq = 1
    )
    WHERE e1.Company LIKE 'Microsoft' and e2.Company LIKE 'Google'
```

In [100]:
df_temp = (df
 .sort_values(by=['Member_ID', 'Year_Start'])
 .assign(seq=lambda x: 
         x.groupby('Member_ID',as_index=False)['Year_Start']
         .rank('first').astype('int'))
 .loc[lambda x: x.Company.isin(('Google','Microsoft'))]
          )

df_temp.pipe(pd.merge, 
             right=df_temp, 
             left_on='Member_ID', right_on='Member_ID',
             suffixes=('_1', '_2')).loc[lambda x: (x.Company_1=='Microsoft') &
    (x.Company_2 == 'Google') & (x.seq_2 - x.seq_1 == 1)
    ]

    Member_ID  Company_1  Year_Start_1  seq_1 Company_2  Year_Start_2  seq_2
1           1  Microsoft          2000      1    Google          2006      2
13          3  Microsoft          2003      3    Google          2004      4

Q5: How many people went from Microsoft to Google and stayed there?

```SQL

    WITH last_year AS (
        SELECT Member_ID, 
        MAX(Year_Start) last_year
        FROM Emp_History 
        GROUP BY Member_ID
    ), last_job AS (
        SELECT e.Member_ID, e.Company, Last_Year
        FROM emp_history AS e JOIN last_year AS l ON (
            e.Member_ID = l.Member_ID AND
            e.Year_Start = l.Last_Year
        )
    
    )
    SELECT DISTINCT (e.Member_ID)
    FROM emp_history AS e JOIN last_job AS l ON (
        
        e.Member_ID = l.Member_ID AND
        e.Year_Start < l.last_year
    )
    WHERE e.Company LIKE 'Microsoft' AND l.company LIKE 'Google'
    


```

In [104]:
last_job = (df
 .sort_values(by=['Member_ID','Year_Start'])
 .groupby('Member_ID', as_index=False)[['Company', 'Year_Start']].last()
)

pd.merge(df.loc[df.Company == 'Microsoft'], last_job, 
         left_on='Member_ID', right_on='Member_ID', suffixes=('_1', '_2')).loc[lambda x: x.Year_Start_1 < x.Year_Start_2].drop_duplicates(subset=['Member_ID'], keep='last')

   Member_ID  Company_1  Year_Start_1 Company_2  Year_Start_2
0          1  Microsoft          2000  Facebook          2012
1          2  Microsoft          2001    Google          2007
3          3  Microsoft          2003    Google          2004
4          4  Microsoft          2004    Google          2006

> **Linkedin Question 4**

In [98]:
# Assume the status table represents status as of 2019-07-01
status = pd.DataFrame(
    {'member_id': [1, 2, 3, 4],
     'status': ['on', 'off', 'on', 'off'],
   }
)

# Members can turn on/off the status
actions = pd.DataFrame(
    {'member_id': [1, 1, 2, 4, 4, 4, 5],
     'date_sk': ['2019-07-02',
                 '2019-07-05',
                 '2019-07-03',
                 '2019-07-10',
                 '2019-07-13',
                 '2019-07-16',
                 '2019-07-09',
                ],
     'action': ['turn_off',
                'turn_on',
                'turn_on',
                'turn_on',
                'turn_on',
                'turn_off',
                'turn_on',         
               ],
    }
)

In [99]:
status

   member_id status
0          1     on
1          2    off
2          3     on
3          4    off

In [100]:
actions

   member_id     date_sk    action
0          1  2019-07-02  turn_off
1          1  2019-07-05   turn_on
2          2  2019-07-03   turn_on
3          4  2019-07-10   turn_on
4          4  2019-07-13   turn_on
5          4  2019-07-16  turn_off
6          5  2019-07-09   turn_on

Question: Latest status for each member?

```SQL

WITH action_seq AS (
    SELECT member_id, action, 
    ROW_NUMBER() OVER (
        PARTITION BY member_id 
        ORDER BY date_sk DESC
    ) AS seq
    FROM actions
), last_action AS (
    SELECT member_id, action AS last_action
    FROM action_seq
    WHERE seq = 1   
), status_action AS (
SELECT s.member_id AS member_id1, 
       l.member_id AS member_id2, status, 
    (
        CASE 
            WHEN last_action LIKE 'turn_off' THEN 'off'
            WHEN last_action LIKE 'turn_on' THEN 'on'
        END
    ) AS last_action
FROM status AS s FULL OUTER JOIN last_action AS l ON (
          s.member_id = l.member_id
    )
)
SELECT COALESCE(member_id1, member_id2) AS member_id, 
(
  CASE 
    WHEN last_action IS NOT NULL THEN last_action
    WHEN last_action is NULL then status
  END
) AS status
FROM status_action
    

```

In [103]:
df_status = status.assign(date_sk = '2019-07-01')
df_action = actions.rename(columns={'action':'status'}).assign(status=lambda x: np.where(x.status=='turn_on', 'on', 'off'))
df = pd.concat([df_status, df_action]).sort_values(by=['member_id', 'date_sk'])
df.groupby('member_id').status.last()

member_id
1     on
2     on
3     on
4    off
5     on
Name: status, dtype: object

#### LC1127

Spending table:
+---------+------------+----------+--------+
| user_id | spend_date | platform | amount |
+---------+------------+----------+--------+
| 1       | 2019-07-01 | mobile   | 100    |
| 1       | 2019-07-01 | desktop  | 100    |
| 2       | 2019-07-01 | mobile   | 100    |
| 2       | 2019-07-02 | mobile   | 100    |
| 3       | 2019-07-01 | desktop  | 100    |
| 3       | 2019-07-02 | desktop  | 100    |
+---------+------------+----------+--------+

Result table:
+------------+----------+--------------+-------------+
| spend_date | platform | total_amount | total_users |
+------------+----------+--------------+-------------+
| 2019-07-01 | desktop  | 100          | 1           |
| 2019-07-01 | mobile   | 100          | 1           |
| 2019-07-01 | both     | 200          | 1           |
| 2019-07-02 | desktop  | 100          | 1           |
| 2019-07-02 | mobile   | 100          | 1           |
| 2019-07-02 | both     | 0            | 0           |
+------------+----------+--------------+-------------+

Write an SQL query to find the total number of users and the total amount spent using mobile only, desktop only and both mobile and desktop together for each date.


```SQL

    WITH dates AS (
      SELECT DISTINCT spend_date
      FROM Spending
    ), platforms AS (
      SELECT platform
      FROM (
      SELECT DISTINCT platform
      FROM Spending
      UNION
      SELECT 'both' AS platform
        ) temp
    ), full_index AS (
      SELECT spend_date, platform
      FROM dates CROSS JOIN platforms
    ), ct_platform AS (
      SELECT spend_date, user_id,
      (
        CASE COUNT(DISTINCT platform) 
          WHEN 2 THEN 'both'
          ELSE MIN(platform)
        END
      ) AS combined_platform, 
      SUM(amount) AS amount
      FROM Spending
      GROUP BY spend_date, user_id
    ), ct_user AS (
      SELECT spend_date, combined_platform, COUNT(user_id) AS users, SUM(amount) AS amount
      FROM ct_platform
      GROUP BY spend_date, combined_platform
    )
    SELECT f.spend_date, f.platform, COALESCE(users, 0) AS users, 
    COALESCE(amount, 0) AS amount
    FROM full_index AS f LEFT JOIN ct_user AS c ON (

      f.spend_date = c.spend_date AND
      f.platform = c.combined_platform
    )
    ORDER BY f.spend_date, f.platform

```

In [63]:
spending_data = StringIO(
"""
user_id,spend_date,platform,amount
1,2019-07-01 00:00:00,mobile, 100
1,2019-07-01 00:00:00,desktop, 100
2,2019-07-01 00:00:00,mobile, 100
2,2019-07-02 00:00:00,mobile, 100
3,2019-07-01 00:00:00,desktop, 100
3,2019-07-02 00:00:00,desktop, 100
"""
)

df = pd.read_csv(spending_data)
df

   user_id           spend_date platform  amount
0        1  2019-07-01 00:00:00   mobile     100
1        1  2019-07-01 00:00:00  desktop     100
2        2  2019-07-01 00:00:00   mobile     100
3        2  2019-07-02 00:00:00   mobile     100
4        3  2019-07-01 00:00:00  desktop     100
5        3  2019-07-02 00:00:00  desktop     100

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     6 non-null      int64
 1   spend_date  6 non-null      object
 2   platform    6 non-null      object
 3   amount      6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [68]:
full_index = pd.DataFrame(index=pd.MultiIndex.from_product((df.spend_date.unique(), ['both', 'mobile', 'desktop']), 
                                                           names=['spend_date', 'platform']))
full_index

Empty DataFrame
Columns: []
Index: [(2019-07-01 00:00:00, both), (2019-07-01 00:00:00, mobile), (2019-07-01 00:00:00, desktop), (2019-07-02 00:00:00, both), (2019-07-02 00:00:00, mobile), (2019-07-02 00:00:00, desktop)]

In [69]:
def unique_platform(df):
    ct = df.platform.nunique()
    first = df.platform.iloc[0]
    total = df.amount.sum()
    cols = ('platform','total')
    if ct == 2:
        return pd.DataFrame.from_records(data=[('both', total)], columns=cols)
    else:
        return pd.DataFrame.from_records(data=[(first, total)], columns=cols)

df_temp = (
    df.groupby(['user_id', 'spend_date']).apply(unique_platform).reset_index()
    .groupby(['spend_date','platform']).agg({'user_id':'count', 'total':'sum'})
    .rename(columns={'user_id':'count'}).join(full_index, how='right').fillna(0)
)

df_temp

                              count  total
spend_date          platform
2019-07-01 00:00:00 both        1.0  200.0
                    mobile      1.0  100.0
                    desktop     1.0  100.0
2019-07-02 00:00:00 both        0.0    0.0
                    mobile      1.0  100.0
                    desktop     1.0  100.0

#### LC1097

Table: Activity
+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| player_id    | int     |
| device_id    | int     |
| event_date   | date    |
| games_played | int     |
+--------------+---------+
(player_id, event_date) is the primary key of this table.
This table shows the activity of players of some game.
Each row is a record of a player who logged in and played a number of games (possibly 0) before logging out on some day using some device.
 
We define the install date of a player to be the first login day of that player.
We also define day 1 retention of some date X to be the number of players whose install date is X and they logged back in on the day right after X, divided by the number of players whose install date is X, rounded to 2 decimal places.
Write an SQL query that reports for each install date, the number of players that installed the game on that day and the day 1 retention.
The query result format is in the following example:
Activity table:
+-----------+-----------+------------+--------------+
| player_id | device_id | event_date | games_played |
+-----------+-----------+------------+--------------+
| 1         | 2         | 2016-03-01 | 5            |
| 1         | 2         | 2016-03-02 | 6            |
| 2         | 3         | 2017-06-25 | 1            |
| 3         | 1         | 2016-03-01 | 0            |
| 3         | 4         | 2016-07-03 | 5            |
+-----------+-----------+------------+--------------+

```SQL

WITH user_history AS (
  SELECT event_date, player_id, 
  ROW_NUMBER() OVER (PARTITION BY player_id ORDER BY event_date) AS rn_event
  FROM Activity
), install_history AS (
  SELECT event_date, COUNT(player_id) AS installs
  FROM user_history
  WHERE rn_event = 1
  GROUP BY event_date
), log AS (
  SELECT player_id, device_id, event_date,
  DATEDIFF(DAY, event_date, LEAD(event_date) OVER (PARTITION BY player_id ORDER BY event_date)) AS days_lapsed,
  games_played
  FROM Activity
), retention AS (
  SELECT event_date, COUNT(player_id) AS retained
  FROM log
  WHERE days_lapsed = 1
  GROUP BY event_date
)  
SELECT s.event_date,installs, retained
FROM install_history s LEFT JOIN retention r ON (
  s.event_date = r.event_date
)
ORDER BY event_date


```

In [71]:
activity = StringIO(
"""
player_id,device_id,event_date,games
1,2,2016-03-01,5
1,2,2016-03-02,6
2,3,2017-06-25,1
3,1,2016-03-01,0
3,4,2016-07-03,5
"""
)

df = pd.read_csv(activity).assign(event_date=lambda x: pd.to_datetime(x.event_date))
df

   player_id  device_id event_date  games
0          1          2 2016-03-01      5
1          1          2 2016-03-02      6
2          2          3 2017-06-25      1
3          3          1 2016-03-01      0
4          3          4 2016-07-03      5

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   player_id   5 non-null      int64
 1   device_id   5 non-null      int64
 2   event_date  5 non-null      datetime64[ns]
 3   games       5 non-null      int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 288.0 bytes

In [73]:
df.groupby('player_id', as_index=False)['event_date'].first().groupby('event_date', as_index=False)['player_id'].count()

  event_date  player_id
0 2016-03-01          2
1 2017-06-25          1

In [75]:
df['next_logon'] = df.groupby('player_id')['event_date'].shift(-1)
df

   player_id  device_id event_date  games next_logon
0          1          2 2016-03-01      5 2016-03-02
1          1          2 2016-03-02      6        NaT
2          2          3 2017-06-25      1        NaT
3          3          1 2016-03-01      0 2016-07-03
4          3          4 2016-07-03      5        NaT

In [81]:
df.loc[(df.next_logon - df.event_date).dt.days == 1]

   player_id  device_id event_date  games next_logon
0          1          2 2016-03-01      5 2016-03-02

In [80]:
(df.next_logon - df.event_date).dt.days

0      1.0
1      NaN
2      NaN
3    124.0
4      NaN
dtype: float64

#### Pandas equivalent of ROW_NUMBER()

In [ ]:
import pandas as pd
import numpy as np
 
#Create a DataFrame
d = {
'Name':['Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine',
'Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine'],
'Subject':['Mathematics','Mathematics','Mathematics','Science','Science','Science',
'History','History','History','Economics','Economics','Economics'],
'Score':[62,47,55,74,31,77,85,63,42,62,89,85]}
 
df = pd.DataFrame(d,columns=['Name','Subject','Score'])
df

In [ ]:
def rank_score(df):
    df_temp = df.sort_values(by=['Score'], ascending=False)
    df_temp['rk'] = df_temp.Score.rank(method='first', ascending=False)  # partition by and order by with row_number
    return df_temp

df.groupby('Name').apply(rank_score)